_posts/2016-06-06-using-emacs.html
---
layout: post
title: GNU Emacs
author: zrg
comments: false
description: Emacs, 快捷键, 主题, ...  
categories: 
- software
tags:
- emacs
photos:
---

<div id="outline-container-org40a6bd7" class="outline-2">
<h2 id="org40a6bd7">快捷键一览表</h2>
<div class="outline-text-2" id="text-org40a6bd7">
</div>
<div id="outline-container-orgc7fc57b" class="outline-3">
<h3 id="orgc7fc57b">在命令行中打开Emacs</h3>
<div class="outline-text-3" id="text-orgc7fc57b">
<pre class="example">
$ emacs -nw filename

</pre>
</div>
</div>
<div id="outline-container-orgde18ef6" class="outline-3">
<h3 id="orgde18ef6">Don't know how to use emacs?</h3>
<div class="outline-text-3" id="text-orgde18ef6">
<pre class="example">
C表示Ctrl，M表示Alt

</pre>
</div>
<div id="outline-container-org7836b07" class="outline-4">
<h4 id="org7836b07">常用的缺省Emacs按键前缀</h4>
<div class="outline-text-4" id="text-org7836b07">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">按键前缀</th>
<th scope="col" class="org-left">描述</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">C-c</td>
<td class="org-left">当前编辑模式特有的命令</td>
</tr>

<tr>
<td class="org-left">C-x</td>
<td class="org-left">文件和缓冲区命令</td>
</tr>

<tr>
<td class="org-left">C-h</td>
<td class="org-left">帮助命令</td>
</tr>

<tr>
<td class="org-left">M-x</td>
<td class="org-left">函数名称</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-orgbd34ffe" class="outline-4">
<h4 id="orgbd34ffe">常用的快捷键</h4>
<div class="outline-text-4" id="text-orgbd34ffe">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">快捷键</th>
<th scope="col" class="org-left">描述</th>
<th scope="col" class="org-left">快捷键</th>
<th scope="col" class="org-left">描述</th>
<th scope="col" class="org-left">快捷键</th>
<th scope="col" class="org-left">描述</th>
<th scope="col" class="org-left">快捷键</th>
<th scope="col" class="org-left">描述</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">C-x  C-c</td>
<td class="org-left">退出</td>
<td class="org-left">C-g</td>
<td class="org-left">退出一个正在运行的命令</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">C-v</td>
<td class="org-left">查看下一屏</td>
<td class="org-left">M-v</td>
<td class="org-left">查看上一屏</td>
<td class="org-left">C-l</td>
<td class="org-left">重绘屏幕，并将光标所在行置于屏幕的中央</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">C-f</td>
<td class="org-left">向右移（forward,前进）</td>
<td class="org-left">C-b</td>
<td class="org-left">向左移（backward，回退）</td>
<td class="org-left">C-p</td>
<td class="org-left">上一行（previous）</td>
<td class="org-left">C-n</td>
<td class="org-left">下一行（next）</td>
</tr>

<tr>
<td class="org-left">M-f</td>
<td class="org-left">向右移（以单词为一个单位）</td>
<td class="org-left">M-b</td>
<td class="org-left">向左移（以单词为一个单位）</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">M-&lt;</td>
<td class="org-left">移动到所有文字最开头</td>
<td class="org-left">M-&gt;</td>
<td class="org-left">移动到所有文字的最末尾</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">C-a</td>
<td class="org-left">移动到行首</td>
<td class="org-left">C-e</td>
<td class="org-left">移动到行尾</td>
<td class="org-left">M-a</td>
<td class="org-left">移动到句首</td>
<td class="org-left">M-e</td>
<td class="org-left">移动到句尾</td>
</tr>

<tr>
<td class="org-left">C-k</td>
<td class="org-left">删除光标后的内容</td>
<td class="org-left">C-y</td>
<td class="org-left">粘贴</td>
<td class="org-left">C-/</td>
<td class="org-left">撤销</td>
<td class="org-left">C-x C-u</td>
<td class="org-left">撤销</td>
</tr>

<tr>
<td class="org-left">C-d</td>
<td class="org-left">删除光标后的字符</td>
<td class="org-left">M-w</td>
<td class="org-left">复制</td>
<td class="org-left">C-SPACE</td>
<td class="org-left">选择内容模式</td>
<td class="org-left">C-w</td>
<td class="org-left">剪切</td>
</tr>

<tr>
<td class="org-left">C-x C-f</td>
<td class="org-left">新建/打开文件</td>
<td class="org-left">C-x C-s</td>
<td class="org-left">保存</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">C-x 2</td>
<td class="org-left">分屏</td>
<td class="org-left">C-x 0</td>
<td class="org-left">切换到窗口1</td>
<td class="org-left">C-x o</td>
<td class="org-left">切换窗口</td>
<td class="org-left">C-h t</td>
<td class="org-left">查看帮助</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org686d45c" class="outline-4">
<h4 id="org686d45c">基本文件操作</h4>
<div class="outline-text-4" id="text-org686d45c">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">快捷键</th>
<th scope="col" class="org-left">描述</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">C-x C-f</td>
<td class="org-left">打开/新建文件</td>
</tr>

<tr>
<td class="org-left">C-x C-s</td>
<td class="org-left">保存</td>
</tr>

<tr>
<td class="org-left">C-x C-w</td>
<td class="org-left">另存为</td>
</tr>

<tr>
<td class="org-left">C-x C-v</td>
<td class="org-left">关闭当前缓冲区文件，打开新文件</td>
</tr>

<tr>
<td class="org-left">C-x i</td>
<td class="org-left">在当前光标位置插入文件</td>
</tr>

<tr>
<td class="org-left">C-x b</td>
<td class="org-left">新建/切换缓存区</td>
</tr>

<tr>
<td class="org-left">C-x C-b</td>
<td class="org-left">显示缓存区列表</td>
</tr>

<tr>
<td class="org-left">C-x k</td>
<td class="org-left">关闭当前缓存区</td>
</tr>

<tr>
<td class="org-left">C-x C-c</td>
<td class="org-left">退出emacs.</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-org9f4edcd" class="outline-4">
<h4 id="org9f4edcd">光标移动</h4>
<div class="outline-text-4" id="text-org9f4edcd">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">快捷键</th>
<th scope="col" class="org-left">描述</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">C-f</td>
<td class="org-left">光标向后移动</td>
</tr>

<tr>
<td class="org-left">C-b</td>
<td class="org-left">光标向前移动</td>
</tr>

<tr>
<td class="org-left">C-p</td>
<td class="org-left">上一行</td>
</tr>

<tr>
<td class="org-left">C-n</td>
<td class="org-left">下一行</td>
</tr>

<tr>
<td class="org-left">M-f</td>
<td class="org-left">光标移动到单词尾部</td>
</tr>

<tr>
<td class="org-left">M-b</td>
<td class="org-left">光标移动到单词头部</td>
</tr>

<tr>
<td class="org-left">C-a</td>
<td class="org-left">行首</td>
</tr>

<tr>
<td class="org-left">C-e</td>
<td class="org-left">行尾</td>
</tr>

<tr>
<td class="org-left">C-v</td>
<td class="org-left">向下翻页</td>
</tr>

<tr>
<td class="org-left">M-v</td>
<td class="org-left">向上翻页</td>
</tr>

<tr>
<td class="org-left">M-&lt;</td>
<td class="org-left">到文件开头</td>
</tr>

<tr>
<td class="org-left">M-&gt;</td>
<td class="org-left">到文件结尾</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-org95eda14" class="outline-4">
<h4 id="org95eda14">文本编辑</h4>
<div class="outline-text-4" id="text-org95eda14">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">快捷键</th>
<th scope="col" class="org-left">描述</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">M-n/C-u n</td>
<td class="org-left">重复执行后一个命令n次</td>
</tr>

<tr>
<td class="org-left">C-d</td>
<td class="org-left">删除后一个字符</td>
</tr>

<tr>
<td class="org-left">M-d</td>
<td class="org-left">删除前一个字符</td>
</tr>

<tr>
<td class="org-left">Del</td>
<td class="org-left">删除前一个字符</td>
</tr>

<tr>
<td class="org-left">M-Del</td>
<td class="org-left">删除前一个单词</td>
</tr>

<tr>
<td class="org-left">C-k</td>
<td class="org-left">移除一行</td>
</tr>

<tr>
<td class="org-left">C-@</td>
<td class="org-left">设定标志位(主要是为了粘贴剪切以及删除使用)</td>
</tr>

<tr>
<td class="org-left">C-w</td>
<td class="org-left">移除标记区域的内容（剪切）</td>
</tr>

<tr>
<td class="org-left">M-w</td>
<td class="org-left">复制标记区域的内容（复制）</td>
</tr>

<tr>
<td class="org-left">C-y</td>
<td class="org-left">粘贴</td>
</tr>

<tr>
<td class="org-left">M-y</td>
<td class="org-left">召回更早的内容 (在kill缓冲区内循环)</td>
</tr>

<tr>
<td class="org-left">C-t</td>
<td class="org-left">交换两个字符的位置</td>
</tr>

<tr>
<td class="org-left">M-t</td>
<td class="org-left">交换两个单词的位置</td>
</tr>

<tr>
<td class="org-left">C-x C-t</td>
<td class="org-left">交换两行的位置</td>
</tr>

<tr>
<td class="org-left">M-u</td>
<td class="org-left">使从光标位置到单词结尾处的字母变成大写</td>
</tr>

<tr>
<td class="org-left">M-l</td>
<td class="org-left">与M-u相反</td>
</tr>

<tr>
<td class="org-left">M-c</td>
<td class="org-left">使从光标位置开始的单词的首字母变为大写</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-orgad8aaa0" class="outline-4">
<h4 id="orgad8aaa0">搜索</h4>
<div class="outline-text-4" id="text-orgad8aaa0">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">快捷键</th>
<th scope="col" class="org-left">描述</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">C-s</td>
<td class="org-left">向前搜索</td>
</tr>

<tr>
<td class="org-left">C-r</td>
<td class="org-left">向前搜索</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-org4881ca8" class="outline-4">
<h4 id="org4881ca8">窗口命令</h4>
<div class="outline-text-4" id="text-org4881ca8">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">快捷键</th>
<th scope="col" class="org-left">描述</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">C-x 2</td>
<td class="org-left">水平分割窗格</td>
</tr>

<tr>
<td class="org-left">C-x 3</td>
<td class="org-left">垂直分割窗格</td>
</tr>

<tr>
<td class="org-left">C-x o</td>
<td class="org-left">切换至其他窗格</td>
</tr>

<tr>
<td class="org-left">C-x 0</td>
<td class="org-left">关闭窗格</td>
</tr>

<tr>
<td class="org-left">C-x 1</td>
<td class="org-left">关闭除了光标所在窗格外所有窗格</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-orgb66ce11" class="outline-4">
<h4 id="orgb66ce11">帮助</h4>
<div class="outline-text-4" id="text-orgb66ce11">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">C-h m</td>
<td class="org-left">查看当前模式</td>
</tr>

<tr>
<td class="org-left">C-h c</td>
<td class="org-left">显示快捷键绑定的命令</td>
</tr>

<tr>
<td class="org-left">C-h k</td>
<td class="org-left">显示快捷键绑定的命令和它的作用</td>
</tr>

<tr>
<td class="org-left">C-h f</td>
<td class="org-left">显示函数的功能</td>
</tr>

<tr>
<td class="org-left">C-h b</td>
<td class="org-left">显示当前缓冲区所有可用的快捷键</td>
</tr>

<tr>
<td class="org-left">C-h t</td>
<td class="org-left">打开emacs教程</td>
</tr>

<tr>
<td class="org-left">M-x quit</td>
<td class="org-left">退出help</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
<div id="outline-container-orgf89a62a" class="outline-3">
<h3 id="orgf89a62a">Emacs org-mode</h3>
<div class="outline-text-3" id="text-orgf89a62a">
</div>
<div id="outline-container-org6fcc668" class="outline-4">
<h4 id="org6fcc668">常用org-mode快捷键</h4>
<div class="outline-text-4" id="text-org6fcc668">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">快捷键</th>
<th scope="col" class="org-left">描述</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">TAB  (org-cycle)</td>
<td class="org-left">Cycle visibility. 循环切换光标所在大纲的状态</td>
</tr>

<tr>
<td class="org-left">RET</td>
<td class="org-left">enter,Select this location.</td>
</tr>

<tr>
<td class="org-left">C-c C-n (org-next-visible-heading)</td>
<td class="org-left">Next heading.</td>
</tr>

<tr>
<td class="org-left">C-c C-p (org-previous-visible-heading)</td>
<td class="org-left">Previous heading.</td>
</tr>

<tr>
<td class="org-left">C-c C-f (org-forward-same-level)</td>
<td class="org-left">Next heading same level.</td>
</tr>

<tr>
<td class="org-left">C-c C-b (org-backward-same-level)</td>
<td class="org-left">Previous heading same level.</td>
</tr>

<tr>
<td class="org-left">C-c C-u (outline-up-heading)</td>
<td class="org-left">Backward to higher level heading.</td>
</tr>

<tr>
<td class="org-left">C-c C-j</td>
<td class="org-left">切换到大纲浏览状态</td>
</tr>

<tr>
<td class="org-left">M-RET (org-meta-return)</td>
<td class="org-left">Insert a new heading, item or row.  插入一个同级标题</td>
</tr>

<tr>
<td class="org-left">C-RET (org-insert-heading-respect-content)</td>
<td class="org-left">Insert a new heading at the end of the current subtree.</td>
</tr>

<tr>
<td class="org-left">M-LEFT/RIGHT</td>
<td class="org-left">将当前标题升/降级</td>
</tr>

<tr>
<td class="org-left">M-S-LEFT/RIGHT</td>
<td class="org-left">将子树升/降级</td>
</tr>

<tr>
<td class="org-left">M-S-UP/DOWN</td>
<td class="org-left">将子树上/下移</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-orgb6b2783" class="outline-4">
<h4 id="orgb6b2783">References</h4>
<div class="outline-text-4" id="text-orgb6b2783">
<pre class="example">
org-mode: 最好的文档编辑利器：http://www.cnblogs.com/holbrook/archive/2012/04/12/2444992.html

</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org61e28eb" class="outline-2">
<h2 id="org61e28eb">自定义Emacs</h2>
<div class="outline-text-2" id="text-org61e28eb">
</div>
<div id="outline-container-orgaf202bd" class="outline-3">
<h3 id="orgaf202bd">Emacs基础定制</h3>
<div class="outline-text-3" id="text-orgaf202bd">
<pre class="example">
打开.emacs文件

</pre>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #5f615c; font-style: italic;">;; </span><span style="color: #5f615c; font-style: italic;">&#26174;&#31034;&#34892;&#21015;&#21495;</span>
(<span style="color: #346604;">setq</span> column-number-mode t)
(<span style="color: #346604;">setq</span> line-number-mode t)
<span style="color: #5f615c; font-style: italic;">;; </span><span style="color: #5f615c; font-style: italic;">&#35774;&#32622;&#26631;&#39064;&#26639;</span>
(<span style="color: #346604;">setq</span> frame-title-format <span style="color: #5c3566;">"Welcome to Emacs world! "</span>)
<span style="color: #5f615c; font-style: italic;">;; </span><span style="color: #5f615c; font-style: italic;">&#31105;&#29992;&#33756;&#21333;&#26639;&#65307;F10&#24320;&#21551;&#33756;&#21333;&#26639;</span>
(menu-bar-mode nil)
<span style="color: #5f615c; font-style: italic;">;; </span><span style="color: #5f615c; font-style: italic;">&#21462;&#28040;&#24037;&#20855;&#26639;</span>
(tool-bar-mode nil)
<span style="color: #5f615c; font-style: italic;">;; </span><span style="color: #5f615c; font-style: italic;">&#21462;&#28040;&#28378;&#21160;&#26639;</span>
(set-scroll-bar-mode nil)
<span style="color: #5f615c; font-style: italic;">;; </span><span style="color: #5f615c; font-style: italic;">&#30452;&#25509;&#25171;&#24320;&#21644;&#26174;&#31034;&#22270;&#29255;</span>
(<span style="color: #346604;">setq</span> auto-image-file-mode t)
<span style="color: #5f615c; font-style: italic;">;; </span><span style="color: #5f615c; font-style: italic;">&#26174;&#31034;&#26102;&#38388;</span>
(display-time-mode t)
<span style="color: #5f615c; font-style: italic;">;; </span><span style="color: #5f615c; font-style: italic;">24&#23567;&#26102;&#21046;</span>
(<span style="color: #346604;">setq</span> display-time-24hr-format t)
<span style="color: #5f615c; font-style: italic;">;; </span><span style="color: #5f615c; font-style: italic;">&#35774;&#32622;F11&#26368;&#22823;&#21270;</span>
(global-set-key [f11] 'maximized)
(<span style="color: #346604;">defun</span> <span style="color: #a40000;">maximized</span> ()
(<span style="color: #346604;">interactive</span>)
(x-send-client-message nil 0 nil <span style="color: #5c3566;">"_NET_WM_STATE"</span> 32 '(2 <span style="color: #5c3566;">"_NET_WM_STATE_MAXIMIZED_HORZ"</span> 0)) (x-send-client-message nil 0 nil <span style="color: #5c3566;">"_NET_WM_STATE"</span> 32 '(2 <span style="color: #5c3566;">"_NET_WM_STATE_MAXIMIZED_VERT"</span> 0))
 )
</pre>
</div>
<pre class="example">
快速使用设置命令: M-x eval-buffer

</pre>
</div>
</div>
<div id="outline-container-orgc3c9114" class="outline-3">
<h3 id="orgc3c9114">自定义高级配置</h3>
<div class="outline-text-3" id="text-orgc3c9114">
<pre class="example">
thems, log manage, ...

</pre>
</div>
<div id="outline-container-orgb11d3db" class="outline-4">
<h4 id="orgb11d3db">Emacs 主题</h4>
<div class="outline-text-4" id="text-orgb11d3db">
<pre class="example">
.el
~/.emacs.d/

</pre>

<pre class="example">
//添加到.emacs文件
(add-to-list 'load-path "~/.emacs.d/")
(require 'pluginname)
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orgadd6d0c" class="outline-2">
<h2 id="orgadd6d0c">问题解决</h2>
<div class="outline-text-2" id="text-orgadd6d0c">
</div>
<div id="outline-container-orgda242b7" class="outline-3">
<h3 id="orgda242b7">emacs不能输入中文</h3>
<div class="outline-text-3" id="text-orgda242b7">
<pre class="example">
//编辑~/.bashrc文件，加入如下内容：
$ vim ~/.bashrc
LC_CTYPE="zh_CN.utf8"

</pre>

<pre class="example">
//编辑/etc/environment文件，加入如下内容：
$ sudo vim /etc/environment
LC_CTYPE="zh_CN.utf8"

</pre>
</div>
</div>
</div>
<div id="outline-container-org84bb7fc" class="outline-2">
<h2 id="org84bb7fc">参考资料</h2>
<div class="outline-text-2" id="text-org84bb7fc">
<pre class="example">
Emacs 从入门到精通: http://blog.chinaunix.net/uid-26185912-id-3334793.html

</pre>
</div>
</div>
